Revit 2027 API
RuledSurface.GetSecondProfileCurve Method
 Returns a copy of the second profile curve if it is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetSecondProfileCurve()
Public Function GetSecondProfileCurve As Curve
public:
Curve^ GetSecondProfileCurve()
member GetSecondProfileCurve : unit -> Curve
Return Value
Curve
 A copy of the second profile curve, if it exists. If a point was used to define the second profile, this function will return null.
See Also
Reference
RuledSurface Class
Autodesk.Revit.DB Namespace